---
kind: other
id: Properties.T:Autodesk.Revit.DB.Plumbing.PipeSegment
source: html/5a773e56-86bb-f022-eba7-162487dca1de.htm
---
# PipeSegment Properties

The id of the assembly instance to which the element belongs.